//Запросить у пользователя число от 0 до 9 и вывести ему спецсимвол, который расположен на этой клавише 
//(1–!, 2–@, 3–# и т. д).

let num = +prompt('Введите число от 0 до 9');

if (num <= 9) {
    if (num === 0) {
        alert(')');
    }
    if (num === 1) {
        alert('!');
    }
    if (num === 2) {
        alert('!');
    }
    if (num === 3) {
        alert('#');
    }
    if (num === 4) {
        alert('$');
    }
    if (num === 5) {
        alert('%');
    }
    if (num === 6) {
        alert('^');
    }
    if (num === 7) {
        alert('&');
    }
    if (num === 8) {
        alert('*');
    }
    if (num === 9) {
        alert('(');
    }

} else {
    alert('Ошибка! Введите число от 0 до 9')
}